Router#en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip access-list extended 110
Router(config-ext-nacl)#deny icmp host 192.168.10.5 host 192.168.11.6
Router(config-ext-nacl)#access-list 110 permit ip any any
Router(config-ext-nacl)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console
Router#en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#ip access-group 110 in
Router(config-if)#exit


Router#show running-config 
Building configuration...

Router>en
Router#show running-config 
Building configuration...

Current configuration : 958 bytes
!
version 12.2
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
!
!
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
interface FastEthernet0/0
 ip address 192.168.10.1 255.255.255.0
 ip access-group 110 in
 duplex auto
 speed auto
!
interface FastEthernet1/0
 ip address 192.168.12.1 255.255.255.0
 duplex auto
 speed auto
!
interface Serial2/0
 ip address 10.0.0.1 255.0.0.0
!
interface Serial3/0
 no ip address
 clock rate 2000000
 shutdown
!
interface FastEthernet4/0
 no ip address
 shutdown
!
interface FastEthernet5/0
 no ip address
 shutdown
!
router rip
 network 10.0.0.0
 network 192.168.10.0
 network 192.168.12.0
!
ip classless
!
ip flow-export version 9
!
!
access-list 110 deny icmp host 192.168.10.5 host 192.168.11.6
access-list 110 permit ip any any
!
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
!