Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router?
router  
Router(config)#router ?
  bgp    Border Gateway Protocol (BGP)
  eigrp  Enhanced Interior Gateway Routing Protocol (EIGRP)
  ospf   Open Shortest Path First (OSPF)
  rip    Routing Information Protocol (RIP)

Router(config)#router eigrp ?
  <1-65535>  Autonomous system number

Router(config)#router eigrp 10
Router(config-router)#?
  auto-summary       Enable automatic network number summarization
  distance           Define an administrative distance
  eigrp              EIGRP specific commands
  exit               Exit from routing protocol configuration mode
  metric             Modify IGRP routing metrics and parameters
  neighbor           Specify a neighbor router
  network            Enable routing on an IP network
  no                 Negate a command or set its defaults
  passive-interface  Suppress routing updates on an interface
  redistribute       Redistribute information from another routing protocol
  variance           Control load balancing variance


Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router eigrp 10
Router(config-router)#network 70.0.0.0 0.255.255.255
Router(config-router)#network 192.168.8.0 0.0.0.255
Router(config-router)#network 80.0.0.0 0.255.255.255


%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/3, changed state to up

%DUAL-5-NBRCHANGE: IP-EIGRP 10: Neighbor 80.0.0.2 (Serial0/3) is up: new adjacency

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/2, changed state to up

%DUAL-5-NBRCHANGE: IP-EIGRP 10: Neighbor 70.0.0.1 (Serial0/2) is up: new adjacency

Router>sh ip eigrp topology
IP-EIGRP Topology Table for AS 10/ID(192.168.8.1)

Codes: P - Passive, A - Active, U - Update, Q - Query, R - Reply,
       r - Reply status

P 50.0.0.0/8, 1 successors, FD is 3193856
         via 70.0.0.1 (3193856/2681856), Serial0/2
P 60.0.0.0/8, 1 successors, FD is 2681856
         via 70.0.0.1 (2681856/2169856), Serial0/2
P 70.0.0.0/8, 1 successors, FD is 2169856
         via Connected, Serial0/2
P 80.0.0.0/8, 1 successors, FD is 2169856
         via Connected, Serial0/3
P 192.168.5.0/24, 1 successors, FD is 3196416
         via 70.0.0.1 (3196416/2684416), Serial0/2
P 192.168.6.0/24, 1 successors, FD is 2684416
         via 70.0.0.1 (2684416/2172416), Serial0/2
P 192.168.7.0/24, 1 successors, FD is 2172416
         via 70.0.0.1 (2172416/28160), Serial0/2
P 192.168.8.0/24, 1 successors, FD is 28160
         via Connected, FastEthernet0/0
P 192.168.9.0/24, 1 successors, FD is 2172416

Router>sh ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

D    50.0.0.0/8 [90/3193856] via 70.0.0.1, 00:27:19, Serial0/2
D    60.0.0.0/8 [90/2681856] via 70.0.0.1, 00:27:19, Serial0/2
C    70.0.0.0/8 is directly connected, Serial0/2
C    80.0.0.0/8 is directly connected, Serial0/3
D    192.168.5.0/24 [90/3196416] via 70.0.0.1, 00:27:19, Serial0/2
D    192.168.6.0/24 [90/2684416] via 70.0.0.1, 00:27:19, Serial0/2
D    192.168.7.0/24 [90/2172416] via 70.0.0.1, 00:27:19, Serial0/2
C    192.168.8.0/24 is directly connected, FastEthernet0/0
D    192.168.9.0/24 [90/2172416] via 80.0.0.2, 00:27:23, Serial0/3

Router>



