Router>enable
Router#
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#interface Serial0/2/1
Router(config-if)#ip address 20.0.0.2 255.0.0.0
Router(config-if)#ip address 20.0.0.2 255.0.0.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/2/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/2/1, changed state to up

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router ospf 30
Router(config-router)#net 192.168.3.0 0.0.0.255 area 1
Router(config-router)#net 20.0.0.0 0.255.255.255 area 1
Router(config-router)#
00:22:39: %OSPF-5-ADJCHG: Process 30, Nbr 192.168.2.1 on Serial0/2/1 from LOADING to FULL, Loading Done

Router#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

O    10.0.0.0/8 [110/128] via 20.0.0.1, 00:08:38, Serial0/2/1
     20.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       20.0.0.0/8 is directly connected, Serial0/2/1
L       20.0.0.2/32 is directly connected, Serial0/2/1
O    192.168.1.0/24 [110/129] via 20.0.0.1, 00:08:38, Serial0/2/1
O IA 192.168.2.0/24 [110/65] via 20.0.0.1, 00:08:38, Serial0/2/1
     192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.3.0/24 is directly connected, FastEthernet0/0
L       192.168.3.1/32 is directly connected, FastEthernet0/0

Router#sh ip route ospf
O    10.0.0.0 [110/128] via 20.0.0.1, 00:08:43, Serial0/2/1
O    192.168.1.0 [110/129] via 20.0.0.1, 00:08:43, Serial0/2/1
O IA 192.168.2.0 [110/65] via 20.0.0.1, 00:08:43, Serial0/2/1