Router#en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip acc
Router(config)#ip access-list ?
  extended  Extended Access List
  standard  Standard Access List
Router(config)#ip access-list standard ?
  <1-99>  Standard IP access-list number
  WORD    Access-list name
Router(config)#ip access-list standard 10 ?
  <cr>
Router(config)#ip access-list standard 10 
Router(config-std-nacl)#?
  <1-2147483647>  Sequence Number
  default         Set a command to its defaults
  deny            Specify packets to reject
  exit            Exit from access-list configuration mode
  no              Negate a command or set its defaults
  permit          Specify packets to forward
  remark          Access list entry comment
Router(config-std-nacl)#permit ?
  A.B.C.D  Address to match
  any      Any source host
  host     A single host address
Router(config-std-nacl)#permit 192.168.2.2 ?
  A.B.C.D  Wildcard bits
  <cr>
Router(config-std-nacl)#permit 192.168.2.2 0.0.0.0 ?
  <cr>
Router(config-std-nacl)#permit 192.168.2.2 0.0.0.0 
Router(config-std-nacl)#deny ?
  A.B.C.D  Address to match
  any      Any source host
  host     A single host address
Router(config-std-nacl)#deny 192.168.2.3 0.0.0.0
Router(config-std-nacl)#exit
Router(config)#int giga0/0
Router(config-if)#ip acc
Router(config-if)#ip access-group 10 out
Router(config-if)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show runn
Router#show running-config 
Building configuration...

Current configuration : 854 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
!
!
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
license udi pid CISCO2911/K9 sn FTX15241U9V-
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface GigabitEthernet0/0
 ip address 10.0.0.1 255.0.0.0
 ip access-group 10 out
 duplex auto
 speed auto
!
interface GigabitEthernet0/1
 ip address 172.168.2.2 255.255.0.0
 duplex auto
 speed auto
!
interface GigabitEthernet0/2
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
ip classless
ip route 192.168.2.0 255.255.255.0 172.168.2.1 
!
ip flow-export version 9
!
!
access-list 10 permit host 192.168.2.2
access-list 10 deny host 192.168.2.3
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
!
!
!
end