Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip acc
Router(config)#ip access-list ext
Router(config)#ip access-list extended 101
Router(config-ext-nacl)#permit ?
  ahp    Authentication Header Protocol
  eigrp  Cisco's EIGRP routing protocol
  esp    Encapsulation Security Payload
  gre    Cisco's GRE tunneling
  icmp   Internet Control Message Protocol
  ip     Any Internet Protocol
  ospf   OSPF routing protocol
  tcp    Transmission Control Protocol
  udp    User Datagram Protocol
Router(config-ext-nacl)#permit tcp ?
  A.B.C.D  Source address
  any      Any source host
  host     A single source host
Router(config-ext-nacl)#permit tcp 192.168.2.0 0.0.0.255 ?
  A.B.C.D  Destination address
  any      Any destination host
  eq       Match only packets on a given port number
  gt       Match only packets with a greater port number
  host     A single destination host
  lt       Match only packets with a lower port number
  neq      Match only packets not on a given port number
  range    Match only packets in the range of port numbers
Router(config-ext-nacl)#permit tcp 192.168.2.0 0.0.0.255 hos
Router(config-ext-nacl)#permit tcp 192.168.2.0 0.0.0.255 host ?
  A.B.C.D  Destination address
Router(config-ext-nacl)#permit tcp 192.168.2.0 0.0.0.255 host 10.0.0.4 ?
  eq           Match only packets on a given port number
  established  established
  gt           Match only packets with a greater port number
  lt           Match only packets with a lower port number
  neq          Match only packets not on a given port number
  range        Match only packets in the range of port numbers
  <cr>
Router(config-ext-nacl)#permit tcp 192.168.2.0 0.0.0.255 host 10.0.0.4 eq ?
  <0-65535>  Port number
  domain     Domain Name Service (DNS, 53)
  ftp        File Transfer Protocol (21)
  pop3       Post Office Protocol v3 (110)
  smtp       Simple Mail Transport Protocol (25)
  telnet     Telnet (23)
  www        World Wide Web (HTTP, 80)
Router(config-ext-nacl)#permit tcp 192.168.2.0 0.0.0.255 host 10.0.0.4 eq 80
Router(config-ext-nacl)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int giga0/0
Router(config-if)#ip access-group 101 in
Router(config-if)#exit
Router(config)#ip access-list extended 101
Router(config-ext-nacl)#permit ?
  ahp    Authentication Header Protocol
  eigrp  Cisco's EIGRP routing protocol
  esp    Encapsulation Security Payload
  gre    Cisco's GRE tunneling
  icmp   Internet Control Message Protocol
  ip     Any Internet Protocol
  ospf   OSPF routing protocol
  tcp    Transmission Control Protocol
  udp    User Datagram Protocol
Router(config-ext-nacl)#permit icmp 192.168.2.0 0.0.0.255 host ?
  A.B.C.D  Destination address
Router(config-ext-nacl)#permit icmp 192.168.2.0 0.0.0.255 host 10.0.0.3
Router(config-ext-nacl)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#show running-config 
Building configuration...

Current configuration : 912 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
!
!
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
license udi pid CISCO2911/K9 sn FTX152496XU-
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface GigabitEthernet0/0
 ip address 192.168.2.1 255.255.255.0
 ip access-group 101 in
 duplex auto
 speed auto
!
interface GigabitEthernet0/1
 ip address 172.168.2.1 255.255.0.0
 duplex auto
 speed auto
!
interface GigabitEthernet0/2
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
ip classless
ip route 10.0.0.0 255.0.0.0 172.168.2.2 
!
ip flow-export version 9
!
!
access-list 101 permit tcp 192.168.2.0 0.0.0.255 host 10.0.0.4 eq www
access-list 101 permit icmp 192.168.2.0 0.0.0.255 host 10.0.0.3
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
!
!
!
end